{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v2.1.0", "userDefinedMetadata": {"signature": {"inputs": {"DQNetwork/Placeholder:0": {"name": "DQNetwork/Placeholder:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "356"}]}}}, "outputs": {"DQNetwork/add:0": {"name": "DQNetwork/add:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}}, "modelTopology": {"node": [{"name": "DQNetwork/Placeholder", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "356"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/value_fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "356"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/advantage/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/value_fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/advantage/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/value/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/value/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/advantage_fc/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "356"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "DQNetwork/advantage_fc/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/value_fc/Elu", "op": "_FusedMatMul", "input": ["DQNetwork/Placeholder", "DQNetwork/value_fc/kernel", "DQNetwork/value_fc/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}}}, {"name": "DQNetwork/advantage_fc/Elu", "op": "_FusedMatMul", "input": ["DQNetwork/Placeholder", "DQNetwork/advantage_fc/kernel", "DQNetwork/advantage_fc/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}}}, {"name": "DQNetwork/value/Elu", "op": "_FusedMatMul", "input": ["DQNetwork/value_fc/Elu", "DQNetwork/value/kernel", "DQNetwork/value/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}}}, {"name": "DQNetwork/advantage/Elu", "op": "_FusedMatMul", "input": ["DQNetwork/advantage_fc/Elu", "DQNetwork/advantage/kernel", "DQNetwork/advantage/bias"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "RWx1"]}}, "transpose_a": {"b": false}}}, {"name": "DQNetwork/Mean", "op": "Mean", "input": ["DQNetwork/advantage/Elu", "DQNetwork/Mean/reduction_indices"], "attr": {"keep_dims": {"b": true}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/Sub", "op": "Sub", "input": ["DQNetwork/advantage/Elu", "DQNetwork/Mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "DQNetwork/add", "op": "Add", "input": ["DQNetwork/Sub", "DQNetwork/value/Elu"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 119}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "DQNetwork/value_fc/kernel", "shape": [356, 256], "dtype": "float32"}, {"name": "DQNetwork/advantage/bias", "shape": [3], "dtype": "float32"}, {"name": "DQNetwork/value_fc/bias", "shape": [256], "dtype": "float32"}, {"name": "DQNetwork/advantage/kernel", "shape": [256, 3], "dtype": "float32"}, {"name": "DQNetwork/value/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "DQNetwork/value/bias", "shape": [1], "dtype": "float32"}, {"name": "DQNetwork/advantage_fc/kernel", "shape": [356, 256], "dtype": "float32"}, {"name": "DQNetwork/Mean/reduction_indices", "shape": [], "dtype": "int32"}, {"name": "DQNetwork/advantage_fc/bias", "shape": [256], "dtype": "float32"}]}]}